ranjithaguna/pv/LED_Demo/source/pic32cx/component/acpi_ec.h
#define ACPI_EC_OS_BYTE_CONTROL_FOUR_BYTE_ACCESS_Pos (0)                                            /**< (ACPI_EC_OS_BYTE_CONTROL) When this bit is set to '1', the ACPI Embedded Controller Interface (ACPI-ECI) accesses four bytes through the\n     ACPI-OS DATA BYTES[3:0]. When this bit is cleared to '0', the ACPI Embedded Controller Interface (ACPI-ECI) accesses one byte\n     through the ACPI OS Data Register Byte 0 Register. This corresponds to Legacy Mode. This bit effects the behaviour of the IBF\n     and OBF bits in the OS STATUS OS Register. Position */
#define ACPI_EC_OS_BYTE_CONTROL_FOUR_BYTE_ACCESS_Msk (0x1U << ACPI_EC_OS_BYTE_CONTROL_FOUR_BYTE_ACCESS_Pos)  /**< (ACPI_EC_OS_BYTE_CONTROL) When this bit is set to '1', the ACPI Embedded Controller Interface (ACPI-ECI) accesses four bytes through the\n     ACPI-OS DATA BYTES[3:0]. When this bit is cleared to '0', the ACPI Embedded Controller Interface (ACPI-ECI) accesses one byte\n     through the ACPI OS Data Register Byte 0 Register. This corresponds to Legacy Mode. This bit effects the behaviour of the IBF\n     and OBF bits in the OS STATUS OS Register. Mask */
#define ACPI_EC_OS_BYTE_CONTROL_Msk           (0x00000001UL)                                 /**< (ACPI_EC_OS_BYTE_CONTROL) Register Mask  */

/* -------- ACPI_EC_EC2OS_DATA_EC_BYTE_ : (ACPI_EC Offset: 0x100) (R/W 8) This is byte n of the 32-bit EC2OS DATA BYTES[3:0]. Writes by the ACPI_EC to the EC2OS DATA BYTES[3:0] are aliased to the\n    ACPI-OS DATA BYTES[3:0]. -------- */

typedef union
{
  uint8_t  w;
} __ACPI_EC_EC2OS_DATA_EC_BYTE__bits_t;
#define ACPI_EC_EC2OS_DATA_EC_BYTE__RESETVALUE (0x00U)                                       /**<  (ACPI_EC_EC2OS_DATA_EC_BYTE_) This is byte n of the 32-bit EC2OS DATA BYTES[3:0]. Writes by the ACPI_EC to the EC2OS DATA BYTES[3:0] are aliased to the\n    ACPI-OS DATA BYTES[3:0].  Reset Value */

#define ACPI_EC_EC2OS_DATA_EC_BYTE__Msk       (0x00000000UL)                                 /**< (ACPI_EC_EC2OS_DATA_EC_BYTE_) Register Mask  */

/* -------- ACPI_EC_EC_STATUS : (ACPI_EC Offset: 0x104) (R/W 8) EC STATUS -------- */

typedef union
{
  struct
  {
    uint8_t  OBF:1;                     /**< bit:      0  The Output Buffer Full bit is set to indicate that a the ACPI_EC has written a data to the ACPI_OS and that data is ready. */
    uint8_t  IBF:1;                     /**< bit:      1  The Input Buffer Full bit is set to indicate that a the ACPI_OS has written a command or data to the ACPI_EC and that data is ready. */
    uint8_t  UD1A:1;                    /**< bit:      2  UD1A User Defined                             */
    uint8_t  CMD:1;                     /**< bit:      3  This bit is set when the OS2EC Data EC Byte 0 Register contains a command byte written into ACPI OS COMMAND Register */
    uint8_t  BURST:1;                   /**< bit:      4  The BURST bit is set when the ACPI_EC is in Burst Mode */
    uint8_t  SCI_EVT:1;                 /**< bit:      5  This bit is set by software when an SCI event is pending */
    uint8_t  SMI_EVT:1;                 /**< bit:      6  This bit is set when an SMI event is pending  */
    uint8_t  UD0A:1;                    /**< bit:      7  User Defined                                  */
  };
  uint8_t  w;
} __ACPI_EC_EC_STATUS_bits_t;
#define ACPI_EC_EC_STATUS_RESETVALUE        (0x00U)                                       /**<  (ACPI_EC_EC_STATUS) EC STATUS  Reset Value */

#define ACPI_EC_EC_STATUS_OBF_Pos             (0)                                            /**< (ACPI_EC_EC_STATUS) The Output Buffer Full bit is set to indicate that a the ACPI_EC has written a data to the ACPI_OS and that data is ready. Position */
#define ACPI_EC_EC_STATUS_OBF_Msk             (0x1U << ACPI_EC_EC_STATUS_OBF_Pos)            /**< (ACPI_EC_EC_STATUS) The Output Buffer Full bit is set to indicate that a the ACPI_EC has written a data to the ACPI_OS and that data is ready. Mask */
#define ACPI_EC_EC_STATUS_IBF_Pos             (1)                                            /**< (ACPI_EC_EC_STATUS) The Input Buffer Full bit is set to indicate that a the ACPI_OS has written a command or data to the ACPI_EC and that data is ready. Position */
#define ACPI_EC_EC_STATUS_IBF_Msk             (0x1U << ACPI_EC_EC_STATUS_IBF_Pos)            /**< (ACPI_EC_EC_STATUS) The Input Buffer Full bit is set to indicate that a the ACPI_OS has written a command or data to the ACPI_EC and that data is ready. Mask */
#define ACPI_EC_EC_STATUS_UD1A_Pos            (2)                                            /**< (ACPI_EC_EC_STATUS) UD1A User Defined Position */
#define ACPI_EC_EC_STATUS_UD1A_Msk            (0x1U << ACPI_EC_EC_STATUS_UD1A_Pos)           /**< (ACPI_EC_EC_STATUS) UD1A User Defined Mask */
#define ACPI_EC_EC_STATUS_CMD_Pos             (3)                                            /**< (ACPI_EC_EC_STATUS) This bit is set when the OS2EC Data EC Byte 0 Register contains a command byte written into ACPI OS COMMAND Register Position */
#define ACPI_EC_EC_STATUS_CMD_Msk             (0x1U << ACPI_EC_EC_STATUS_CMD_Pos)            /**< (ACPI_EC_EC_STATUS) This bit is set when the OS2EC Data EC Byte 0 Register contains a command byte written into ACPI OS COMMAND Register Mask */
#define ACPI_EC_EC_STATUS_BURST_Pos           (4)                                            /**< (ACPI_EC_EC_STATUS) The BURST bit is set when the ACPI_EC is in Burst Mode Position */
#define ACPI_EC_EC_STATUS_BURST_Msk           (0x1U << ACPI_EC_EC_STATUS_BURST_Pos)          /**< (ACPI_EC_EC_STATUS) The BURST bit is set when the ACPI_EC is in Burst Mode Mask */
#define ACPI_EC_EC_STATUS_SCI_EVT_Pos         (5)                                            /**< (ACPI_EC_EC_STATUS) This bit is set by software when an SCI event is pending Position */
#define ACPI_EC_EC_STATUS_SCI_EVT_Msk         (0x1U << ACPI_EC_EC_STATUS_SCI_EVT_Pos)        /**< (ACPI_EC_EC_STATUS) This bit is set by software when an SCI event is pending Mask */
#define ACPI_EC_EC_STATUS_SMI_EVT_Pos         (6)                                            /**< (ACPI_EC_EC_STATUS) This bit is set when an SMI event is pending Position */
#define ACPI_EC_EC_STATUS_SMI_EVT_Msk         (0x1U << ACPI_EC_EC_STATUS_SMI_EVT_Pos)        /**< (ACPI_EC_EC_STATUS) This bit is set when an SMI event is pending Mask */
#define ACPI_EC_EC_STATUS_UD0A_Pos            (7)                                            /**< (ACPI_EC_EC_STATUS) User Defined Position */
#define ACPI_EC_EC_STATUS_UD0A_Msk            (0x1U << ACPI_EC_EC_STATUS_UD0A_Pos)           /**< (ACPI_EC_EC_STATUS) User Defined Mask */
#define ACPI_EC_EC_STATUS_Msk                 (0x000000FFUL)                                 /**< (ACPI_EC_EC_STATUS) Register Mask  */

