ranjithaguna/pv/LED_Demo/source/pic32cx/component/acpi_ec.h
/* -------- ACPI_EC_EC_BYTE_CONTROL : (ACPI_EC Offset: 0x105) (R/W 8) Byte Control EC-Register -------- */

typedef union
{
  struct
  {
    uint8_t  FOUR_BYTE_ACCESS:1;        /**< bit:      0  When this bit is set to '1', the ACPI Embedded Controller Interface (ACPI-ECI) accesses four bytes through the\n     ACPI-OS DATA BYTES[3:0]. When this bit is cleared to '0', the ACPI Embedded Controller Interface (ACPI-ECI) accesses one byte\n     through the ACPI OS Data Register Byte 0 Register. This corresponds to Legacy Mode. This bit effects the behaviour of the IBF\n     and OBF bits in the OS STATUS OS Register. */
    uint8_t  :7;                        /**< bit:   1..7  Reserved                                      */
  };
  uint8_t  w;
} __ACPI_EC_EC_BYTE_CONTROL_bits_t;
#define ACPI_EC_EC_BYTE_CONTROL_RESETVALUE  (0x00U)                                       /**<  (ACPI_EC_EC_BYTE_CONTROL) Byte Control EC-Register  Reset Value */

#define ACPI_EC_EC_BYTE_CONTROL_FOUR_BYTE_ACCESS_Pos (0)                                            /**< (ACPI_EC_EC_BYTE_CONTROL) When this bit is set to '1', the ACPI Embedded Controller Interface (ACPI-ECI) accesses four bytes through the\n     ACPI-OS DATA BYTES[3:0]. When this bit is cleared to '0', the ACPI Embedded Controller Interface (ACPI-ECI) accesses one byte\n     through the ACPI OS Data Register Byte 0 Register. This corresponds to Legacy Mode. This bit effects the behaviour of the IBF\n     and OBF bits in the OS STATUS OS Register. Position */
#define ACPI_EC_EC_BYTE_CONTROL_FOUR_BYTE_ACCESS_Msk (0x1U << ACPI_EC_EC_BYTE_CONTROL_FOUR_BYTE_ACCESS_Pos)  /**< (ACPI_EC_EC_BYTE_CONTROL) When this bit is set to '1', the ACPI Embedded Controller Interface (ACPI-ECI) accesses four bytes through the\n     ACPI-OS DATA BYTES[3:0]. When this bit is cleared to '0', the ACPI Embedded Controller Interface (ACPI-ECI) accesses one byte\n     through the ACPI OS Data Register Byte 0 Register. This corresponds to Legacy Mode. This bit effects the behaviour of the IBF\n     and OBF bits in the OS STATUS OS Register. Mask */
#define ACPI_EC_EC_BYTE_CONTROL_Msk           (0x00000001UL)                                 /**< (ACPI_EC_EC_BYTE_CONTROL) Register Mask  */

/* -------- ACPI_EC_OS2EC_DATA_EC_BYTE_ : (ACPI_EC Offset: 0x108) (R/W 8) OS_TO_EC_DATA_BYTE_n. This is byte n of the 32-bit OS2EC DATA BYTES[3:0]. When the CMD bit in the OS STATUS OS Register\n    is cleared to '0', reads by the ACPI_EC from the OS2EC DATA BYTES[3:0] are aliased to the ACPI-OS DATA BYTES[3:0]. -------- */

typedef union
{
  uint8_t  w;
} __ACPI_EC_OS2EC_DATA_EC_BYTE__bits_t;
#define ACPI_EC_OS2EC_DATA_EC_BYTE__RESETVALUE (0x00U)                                       /**<  (ACPI_EC_OS2EC_DATA_EC_BYTE_) OS_TO_EC_DATA_BYTE_n. This is byte n of the 32-bit OS2EC DATA BYTES[3:0]. When the CMD bit in the OS STATUS OS Register\n    is cleared to '0', reads by the ACPI_EC from the OS2EC DATA BYTES[3:0] are aliased to the ACPI-OS DATA BYTES[3:0].  Reset Value */

#define ACPI_EC_OS2EC_DATA_EC_BYTE__Msk       (0x00000000UL)                                 /**< (ACPI_EC_OS2EC_DATA_EC_BYTE_) Register Mask  */

/** \brief ACPI_EC register offsets definitions */
#define ACPI_EC_ACPI_OS_DATA_BYTE__OFFSET (0x00)         /**< (ACPI_EC_ACPI_OS_DATA_BYTE_) This is byte n of the 32-bit ACPI-OS DATA BYTES[3:0]. Writes by the ACPI_OS to the ACPI-OS DATA BYTES[n] are aliased\n    to the OS2EC DATA BYTES[n]. Reads by the ACPI_OS from the ACPI-OS DATA BYTES[n] are aliased to the EC2OS DATA BYTES[n]. Offset */
#define ACPI_EC_ACPI_OS_COMMAND_OFFSET (0x04)         /**< (ACPI_EC_ACPI_OS_COMMAND) Writes to the this register are aliased in the OS2EC Data EC Byte 0 Register.\n              Writes to this register also set the CMD and IBF bits in the OS STATUS OS Register Offset */
#define ACPI_EC_OS_BYTE_CONTROL_OFFSET (0x05)         /**< (ACPI_EC_OS_BYTE_CONTROL) OS Byte Control Register Offset */
#define ACPI_EC_EC2OS_DATA_EC_BYTE__OFFSET (0x100)        /**< (ACPI_EC_EC2OS_DATA_EC_BYTE_) This is byte n of the 32-bit EC2OS DATA BYTES[3:0]. Writes by the ACPI_EC to the EC2OS DATA BYTES[3:0] are aliased to the\n    ACPI-OS DATA BYTES[3:0]. Offset */
#define ACPI_EC_EC_STATUS_OFFSET     (0x104)        /**< (ACPI_EC_EC_STATUS) EC STATUS Offset */
#define ACPI_EC_EC_BYTE_CONTROL_OFFSET (0x105)        /**< (ACPI_EC_EC_BYTE_CONTROL) Byte Control EC-Register Offset */
#define ACPI_EC_OS2EC_DATA_EC_BYTE__OFFSET (0x108)        /**< (ACPI_EC_OS2EC_DATA_EC_BYTE_) OS_TO_EC_DATA_BYTE_n. This is byte n of the 32-bit OS2EC DATA BYTES[3:0]. When the CMD bit in the OS STATUS OS Register\n    is cleared to '0', reads by the ACPI_EC from the OS2EC DATA BYTES[3:0] are aliased to the ACPI-OS DATA BYTES[3:0]. Offset */

/** \brief ACPI_EC register API structure */
typedef struct
{  /* The ACPI Embedded Controller Interface (ACPI-ECI) provides a four byte full\n        duplex data interface which is a superset of the standard ACPI Embedded Controller Interface\n        (ACPI-ECI) one byte data interface. The ACPI Embedded Controller Interface (ACPI-ECI) defaults\n        to the standard one byte interface. */
  __IO  __ACPI_EC_ACPI_OS_DATA_BYTE__bits_t ACPI_OS_DATA_BYTE_[4]; /**< Offset: 0x00 (R/W   8) This is byte n of the 32-bit ACPI-OS DATA BYTES[3:0]. Writes by the ACPI_OS to the ACPI-OS DATA BYTES[n] are aliased\n    to the OS2EC DATA BYTES[n]. Reads by the ACPI_OS from the ACPI-OS DATA BYTES[n] are aliased to the EC2OS DATA BYTES[n]. */
  __O   __ACPI_EC_ACPI_OS_COMMAND_bits_t ACPI_OS_COMMAND; /**< Offset: 0x04 ( /W   8) Writes to the this register are aliased in the OS2EC Data EC Byte 0 Register.\n              Writes to this register also set the CMD and IBF bits in the OS STATUS OS Register */
  __I   __ACPI_EC_OS_STATUS_bits_t     OS_STATUS;     /**< Offset: 0x04 (R/    8) OS STATUS */
  __I   __ACPI_EC_OS_BYTE_CONTROL_bits_t OS_BYTE_CONTROL; /**< Offset: 0x05 (R/    8) OS Byte Control Register */
  __IO  __ACPI_EC_EC2OS_DATA_EC_BYTE__bits_t EC2OS_DATA_EC_BYTE_[4]; /**< Offset: 0x100 (R/W   8) This is byte n of the 32-bit EC2OS DATA BYTES[3:0]. Writes by the ACPI_EC to the EC2OS DATA BYTES[3:0] are aliased to the\n    ACPI-OS DATA BYTES[3:0]. */
  __IO  __ACPI_EC_EC_STATUS_bits_t     EC_STATUS;     /**< Offset: 0x104 (R/W   8) EC STATUS */
  __IO  __ACPI_EC_EC_BYTE_CONTROL_bits_t EC_BYTE_CONTROL; /**< Offset: 0x105 (R/W   8) Byte Control EC-Register */
  __IO  __ACPI_EC_OS2EC_DATA_EC_BYTE__bits_t OS2EC_DATA_EC_BYTE_[4]; /**< Offset: 0x108 (R/W   8) OS_TO_EC_DATA_BYTE_n. This is byte n of the 32-bit OS2EC DATA BYTES[3:0]. When the CMD bit in the OS STATUS OS Register\n    is cleared to '0', reads by the ACPI_EC from the OS2EC DATA BYTES[3:0] are aliased to the ACPI-OS DATA BYTES[3:0]. */
} acpiec_registers_t;
/** @}  end of The ACPI Embedded Controller Interface (ACPI-ECI) provides a four byte full\n        duplex data interface which is a superset of the standard ACPI Embedded Controller Interface\n        (ACPI-ECI) one byte data interface. The ACPI Embedded Controller Interface (ACPI-ECI) defaults\n        to the standard one byte interface. */

#endif /* _PIC32CX_0525SG12_ACPI_EC_COMPONENT_H_ */
